Revit 2027 API
UIDocument.ShowElements(ElementId) Method
Shows the element by zoom to fit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ShowElements(
	ElementId elementId
)
Public Sub ShowElements (
	elementId As ElementId
)
public:
void ShowElements(
	ElementId^ elementId
)
member ShowElements :
        elementId : ElementId -> unit
Parameters
elementId ElementId
Element id that will be shown.
Exceptions
Exception | Condition
ArgumentException | Element id is not valid.
Remarks
Places the element in the center of screen by moving the view.
See Also
Reference
UIDocument Class
ShowElements Overload
Autodesk.Revit.UI Namespace